Backward-Facing_symmetryPlane/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          306;
        startFace       1208733;
    }
    outlet
    {
        type            patch;
        nFaces          387;
        startFace       1209039;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3840;
        startFace       1209426;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3921;
        startFace       1213266;
    }
    frontAndBack
    {
        type            symmetryPlane;
//        inGroups        List<word> 1(empty);
        nFaces          303240;
        startFace       1217187;
    }
)

// ************************************************************************* //
