Backward-Facing_symmetryPlane/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          fluid;

startFrom       latestTime; //startTime; //latestTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.3e-05;

writeControl    runTime; // timeStep;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes; // yes;

maxCo           0.5;

// ************************************************************************* //
/*
functions
{
//    #include "readFields"
//    #include "streamLines" //не работает постпроцесс не создаёт
//    #include "wallBoundedStreamLines"
//    #include "cuttingPlane"
//    #include "forceCoeffs"
}
*/
