Backward-Facing_symmetryPlane/system/streamlines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

streamlines
{
    type            streamlines;

    libs            ("libfieldFunctionObjects.so");

    // Output every
    writeControl    writeTime;

    // Write format
    setFormat       vtk;

    // Перемещайтесь вперед (+U) или назад (-U), или и вперед, и назад.
    direction       forward;

    // Названия полей для выборки. Должны содержать указанное выше поле скоростей!
    fields (p U k);

    // Частицы могут перемещаться на несколько шагов, прежде чем будут удалены.
    lifeTime        10000;

    // Количество шагов на ячейку (оценка). Установите значение 1, чтобы отключить субциклирование.
    nSubCycle 5;

    // Имя облака для использования
//    cloudName       particleTracks;

    // Seeding method.
    seedSampleSet
    {
        type        boundaryRandom;
        patches     (inlet);
        nPoints     100;
        axis        y;
    }

/*
    seedSampleSet
    {
        type        lineUniform;
        start       (-0.0205 0.001 0.00001);
        end         (-0.0205 0.0251 0.00001);
        nPoints     100;
        //axis        x;
    }
*/

}
/*

/*
Основные параметры boundaryRandom
patches — список патчей, на которых производится выборка. Требуется для корректной работы.
nPoints — количество точек для генерации. Обязательный параметр.
axis — координатная ось, вдоль которой выполняется выборка.

seedSampleSet
{
    type        lineUniform;
    start       (x1 y1 z1);  // начальная точка линии
    end         (x2 y2 z2);  // конечная точка линии
    nPoints     N;           // количество точек (равномерно распределённых)
    axis        X;           // ось для вывода координат (x, y, z или distance)
}

 seedSampleSet {
    type uniform;
    axis x;
    start (-0.0205 0.0001 0.00001);
    end (-0.0205 0.0005 0.00001);
    nPoints 100;
}
/*
lineUniform — равномерное засеивание частиц вдоль линии.
sphereRandom — случайное засеивание частиц внутри сферы.
boundaryRandom — случайное засеивание частиц на нескольких патчах.
points — указанный набор местоположений.
cloud — облако точек.
triSurfaceMeshPointSet — точки в соответствии с трёхповерхностной сеткой.
 * */

// ************************************************************************* //
